11/data/attachments/34442a64cc4f9d14.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_864345ea-caba-4b45-ba99-f08823b7c9b5</nif:username>
            <nif:friendToBeAdded>Jake_four_Actions_96236_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>